Revit 2027 API
ParameterTypeId.RbsComponentClassificationParam Property
 "Component Classification"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RbsComponentClassificationParam { get; }
Public Shared ReadOnly Property RbsComponentClassificationParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RbsComponentClassificationParam {
	ForgeTypeId^ get ();
}
static member RbsComponentClassificationParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace